/*-------------------------------------------------
*  Author:Rainboy
*  time: 2016年01月05日 星期二 16时11分54秒
*  © Copyright 2016 Rainboy. All Rights Reserved.
*-------------------------------------------------*/

/* 
 * 取位的代码
 * while (b ！=0  )
 *      int a= b& 1;
 *      b= b>>1;
 *
|-----+-----+-----+-----|
| 1   | 0   | 1   | 1   |
|-----+-----+-----+-----|
| 2^3 | 2^2 | 2^1 | 2^0 | 1*a^2^3 * 0*a^2^2* 1*a^2^1 * 1*a^2^0
|-----+-----+-----+-----|
| a^8 | a^4 | a^2 | a^1 |
|--+--+-----+-----+-----|

我们可以看到这样的规律 
1. a 是倍增的 a  a^2  a^4  a^8
2. 具体乘以 还是不乘以 a^* 是要看对应的二进制的位数 是1 还是 0
3. 任意 数的 0次方 为1
*/
int fast_pow(int a, int b) //求 a^b
{
    int r=1,base =a;
    while(b != 0){
        if(b & 1)  // 假如b = 1011(二进制) 1->1->0->1 base,base^1
            r*=base;
        base*=base;
        b=b>>1;
    }
    return r;
}
